In [2]:
import pandas as pd
ser = pd.Series([1, 3, 5, 7, 9], index=['a', 'b', 'c', 'd', 'e'])
print(ser)

a    1
b    3
c    5
d    7
e    9
dtype: int64

In [ ]:
import pandas as pd
ser2 = pd.Series([1, 3, 5, 7, 9], index=['a', 'b', 'c', 'd', 'e'])
print(ser2)

a    1
b    3
c    5
d    7
e    9
dtype: int64

In [4]:
import pandas as pd
ser =ser + ser2
print(ser)

a     2
b     6
c    10
d    14
e    18
dtype: int64

In [15]:
import pandas as pd
import numpy as np
from numpy.random import randn
np.random.seed(101)
df = pd.DataFrame(randn(5,4),["a","b","c","d","e"],["w","x","y","z"])
print(df)
df[["w","z"]]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

          w         z
a  2.706850  0.503826
b  0.651118  0.605965
c -2.018168 -0.589001
d  0.188695  0.955057
e  0.190794  0.683509

In [12]:
df['new'] = df['w']+df['x']
df[["w","z"]]
df

          w         x         y         z       new
a  2.706850  0.628133  0.907969  0.503826  3.334983
b  0.651118 -0.319318 -0.848077  0.605965  0.331800
c -2.018168  0.740122  0.528813 -0.589001 -1.278046
d  0.188695 -0.758872 -0.933237  0.955057 -0.570177
e  0.190794  1.978757  2.605967  0.683509  2.169552

In [10]:
df.drop('new',axis=1, inplace=True)
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [6]:
import pandas as pd
df=pd.read_csv('fear_greed_index.csv')
print(df.head())
print(df.tail())

    timestamp  value classification        date
0  1517463000     30           Fear  2018-02-01
1  1517549400     15   Extreme Fear  2018-02-02
2  1517635800     40           Fear  2018-02-03
3  1517722200     24   Extreme Fear  2018-02-04
4  1517808600     11   Extreme Fear  2018-02-05
       timestamp  value classification        date
2639  1745818200     54        Neutral  2025-04-28
2640  1745904600     60          Greed  2025-04-29
2641  1745991000     56          Greed  2025-04-30
2642  1746077400     53        Neutral  2025-05-01
2643  1746163800     67          Greed  2025-05-02

In [ ]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})
print(df)
df.dropna()
df.dropna(axis=1)   
df.dropna(thresh=2)
df.fillna(value='FILL VALUE')
df['A'].fillna(value=df['A'].mean())
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [10]:
# Exercise 1: Create a pandas DataFrame from a dictionary with the following data:
# Name Age City
# Alice 24 New York
# Bob 27 London
# Charlie 22 Paris


data = {
    "Name": ["alic", "bob", "charli"],
    "Age": [24,27,22],
    "City": ["newyork", "london", "Paris"]
}
df =pd.DataFrame(data)
df

     Name  Age     City
0    alic   24  newyork
1     bob   27   london
2  charli   22    Paris

In [ ]:
# Exercise 2: Read a CSV file named students.csv into a pandas DataFrame.
import  pandas as pd
df =pd.read_csv("student.csv")
print(df)
print(df.info())

       timestamp  value classification        date
0     1517463000     30           Fear  2018-02-01
1     1517549400     15   Extreme Fear  2018-02-02
2     1517635800     40           Fear  2018-02-03
3     1517722200     24   Extreme Fear  2018-02-04
4     1517808600     11   Extreme Fear  2018-02-05
...          ...    ...            ...         ...
2639  1745818200     54        Neutral  2025-04-28
2640  1745904600     60          Greed  2025-04-29
2641  1745991000     56          Greed  2025-04-30
2642  1746077400     53        Neutral  2025-05-01
2643  1746163800     67          Greed  2025-05-02

[2644 rows x 4 columns]
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2644 entries, 0 to 2643
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   timestamp       2644 non-null   int64
 1   value           2644 non-null   int64
 2   classification  2644 non-null   object
 3   date            2644 non-null   object
dtypes: int64(2), object(2)
memory usage: 82.8+ KB
None

In [35]:
# Exercise 3: Display the first 3 rows, column names, and data types.

import  pandas as pd
df =pd.read_csv("student.csv")
print(df.head(3))
print(df.head(3).to_string())
print(df.columns.to_list())
print(type(df.columns))
print(df.dtypes)

    Roll No        Name  Age Gender Grade   City
0       101   Alice Rao   20      F     A  Mumbai
1       102   Bob Singh   21      M     B  Delhi
2       103  Charu Jain   19      F     A    Bengaluru
    Roll No        Name  Age Gender Grade   City
0       101   Alice Rao   20      F     A  Mumbai
1       102   Bob Singh   21      M     B  Delhi
2       103  Charu Jain   19      F     A    Bengaluru
[' Roll No', 'Name', 'Age', 'Gender', 'Grade', 'City        ']
<class 'pandas.core.indexes.base.Index'>
 Roll No         int64
Name            object
Age              int64
Gender          object
Grade           object
City            object
dtype: object

In [36]:
# Exercise 4: Select only the Age column.
import pandas as pd
df = pd.read_csv("student.csv")
k = df["Age"]
print(k)

0    20
1    21
2    19
3    22
4    20
Name: Age, dtype: int64

In [46]:
# Exercise 5: Filter Rows Select students whose age is greater than 23.
import pandas as pd
df = pd.read_csv("student.csv")
k = df[df['Age']>23]
print(k)

    Roll No    Name  Age Gender Grade City
5       106  pranav   24      M     A       bhopal

In [ ]:
# Exercise 6: Add a New Column Add a column Marks = [85, 90, 78] to the DataFrame.

import pandas as pd
df = pd.read_csv("student.csv")
df['marks']  = [60,57,68,78,96,97]

df.to_csv("student.csv",index=False)
print(df)

    Roll No        Name  Age Gender Grade   City          marks
0       101   Alice Rao   20      F     A  Mumbai            60
1       102   Bob Singh   21      M     B  Delhi             57
2       103  Charu Jain   19      F     A    Bengaluru       68
3       104  Danish Ali   22      M     C    Hyderabad       78
4       105   Eva Patel   20      F     B    Ahmedabad       96
5       106      pranav   24      M     A         Bhopal     97

In [60]:
# Exercise 7: Summary Statistics Find the mean, min, and max of the Age column.
import pandas as pd
df = pd.read_csv("student.csv")
min1 =df['Age'].min()
max1 = df['Age'].max()
mean1 = df["Age"].mean()
print("minimum",min1)
print("maximum",max1)
print("mean",mean1)

minimum 19
maximum 24
mean 21.0

In [ ]:
# Exercise 8: Sort Data Sort the DataFrame by Marks in descending order.[Hint: use sort_values()]
import pandas as pd
df = pd.read_csv("student.csv")
# df.to_csv("student.csv",index=False)
k=df.sort_values(by="marks",ascending=False)
print(k)

    Roll No        Name  Age Gender Grade   City          marks
5       106      pranav   24      M     A         Bhopal     97
4       105   Eva Patel   20      F     B    Ahmedabad       96
3       104  Danish Ali   22      M     C    Hyderabad       78
2       103  Charu Jain   19      F     A    Bengaluru       68
0       101   Alice Rao   20      F     A  Mumbai            60
1       102   Bob Singh   21      M     B  Delhi             57

In [19]:
# Exercise 9: Group By Group the data by City and find the average Age.
import pandas as pd
df = pd.read_csv("student.csv")
data = df.groupby("City")["Age"].mean()
print(data)

City
Ahmedabad    20.0
Bengaluru    19.0
Bhopal       24.0
Delhi        21.0
Hyderabad    22.0
Mumbai       20.0
Name: Age, dtype: float64

In [20]:
# Exercise 10: Save to CSV Save the DataFrame to a file named output.csv.

data = {
    "Name": ["alic", "bob", "charli"],
    "Age": [24,27,22],
    "City": ["newyork", "london", "Paris"]
}
df =pd.DataFrame(data)

df.to_csv("output.csv",index=False)
df

     Name  Age     City
0    alic   24  newyork
1     bob   27   london
2  charli   22    Paris

In [ ]:
# # Welcome to a quick exercise for you to practice your pandas skills! We will be using the SF Salaries Dataset from Kaggle! Just follow along and complete the tasks outlined in bold
# below. The tasks will get harder and harder as you go along. URL : https://www.kaggle.com/datasets/kaggle/sf-salaries
# ** Import pandas as pd.**
# ** Read Salaries.csv as a dataframe called sal.**
# ** Check the head of the DataFrame. **

import pandas as pd
df = pd.read_csv("Salaries.csv")
df.head()

C:\Users\prash\AppData\Local\Temp\ipykernel_16972\4207562064.py:2: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv("Salaries.csv")

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [ ]:
# ** Use the .info() method to find out how many entries there are.**

import pandas as pd
df = pd.read_csv("Salaries.csv")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

C:\Users\prash\AppData\Local\Temp\ipykernel_16972\1472998259.py:2: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv("Salaries.csv")

In [6]:
# What is the average BasePay ?

import pandas as pd
df = pd.read_csv("Salaries.csv")
arr = pd.to_numeric(df['BasePay'], errors='coerce')
k= arr.mean()
print(k)

66325.4488404877

C:\Users\prash\AppData\Local\Temp\ipykernel_3156\431416331.py:4: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv("Salaries.csv")

In [7]:
# ** What is the highest amount of OvertimePay in the dataset ? **

import pandas as pd
df = pd.read_csv("Salaries.csv")
arr = pd.to_numeric(df['OvertimePay'], errors='coerce')
k= arr.max()
print(k)

245131.88

C:\Users\prash\AppData\Local\Temp\ipykernel_3156\3079004249.py:4: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv("Salaries.csv")

In [9]:
# ** What is the job title of JOSEPH DRISCOLL ? Note: Use all caps, otherwise you may get an answer that doesn&#39;t match up (there is also a lowercase Joseph Driscoll). **


import pandas as pd
df = pd.read_csv("Salaries.csv")
arry = df[df['EmployeeName'] == "JOSEPH DRISCOLL"]
print(arry[['EmployeeName',"JobTitle"]])

       EmployeeName                   JobTitle
24  JOSEPH DRISCOLL  CAPTAIN, FIRE SUPPRESSION

C:\Users\prash\AppData\Local\Temp\ipykernel_9276\4209785140.py:5: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv("Salaries.csv")

In [ ]:
# ** How much does JOSEPH DRISCOLL make (including benefits)? **


import pandas as pd
df = pd.read_csv("Salaries.csv")
arry = df[df['EmployeeName'] == "JOSEPH DRISCOLL"]
# print(arry)
print(arry[["TotalPayBenefits"]])

    TotalPayBenefits
24         270324.91

C:\Users\prash\AppData\Local\Temp\ipykernel_14304\1582449953.py:5: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv("Salaries.csv")

In [ ]:
# ** What is the name of highest paid person (including benefits)?**



import pandas as pd
df = pd.read_csv("Salaries.csv")
arr = df.loc[df["TotalPayBenefits"].idxmax()]
print(arr[['EmployeeName', "TotalPayBenefits"]])

EmployeeName        NATHANIEL FORD
TotalPayBenefits         567595.43
Name: 0, dtype: object

C:\Users\prash\AppData\Local\Temp\ipykernel_14304\2910876127.py:9: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv("Salaries.csv")

In [ ]:
# ** What is the name of lowest paid person (including benefits)? Do you notice something strange about how much he or she is paid?**


import pandas as pd
df = pd.read_csv("Salaries.csv")
arr = df.loc[df["TotalPayBenefits"].idxmin()]
print(arr[['EmployeeName', "TotalPayBenefits"]])

EmployeeName        Joe Lopez
TotalPayBenefits      -618.13
Name: 148653, dtype: object

C:\Users\prash\AppData\Local\Temp\ipykernel_14304\334022099.py:2: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv("Salaries.csv")

In [28]:
# ** What was the average (mean) BasePay of all employees per year? (2011-2014) ? **
# What is the average BasePay ?

import pandas as pd
df = pd.read_csv("Salaries.csv")
arr = pd.to_numeric(df['BasePay'],errors='coerce')

arr= df.groupby("Year")
k = arr.mean(numeric_only=True)
print(k)

            Id      TotalPay  TotalPayBenefits  Notes
Year
2011   18080.0  71744.103871      71744.103871    NaN
2012   54542.5  74113.262265     100553.229232    NaN
2013   91728.5  77611.443142     101440.519714    NaN
2014  129593.0  75463.918140     100250.918884    NaN

C:\Users\prash\AppData\Local\Temp\ipykernel_14304\1917537584.py:5: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv("Salaries.csv")

In [30]:
# ** How many unique job titles are there? **[Hint: Explore and use value_counts() ]
import pandas as pd
df = pd.read_csv("Salaries.csv")
arr = df.value_counts("JobTitle")
k = len(arr)
print(k)

2159

C:\Users\prash\AppData\Local\Temp\ipykernel_14304\4012303747.py:3: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv("Salaries.csv")

In [31]:
# ** What are the top 5 most common jobs? **
import pandas as pd
df = pd.read_csv("Salaries.csv")
arr = df.value_counts("JobTitle")
print(arr.head())

JobTitle
Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: count, dtype: int64

C:\Users\prash\AppData\Local\Temp\ipykernel_14304\2120384800.py:3: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv("Salaries.csv")

In [45]:
# ** How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?) **

import pandas as pd
df = pd.read_csv("Salaries.csv")
arr= df[df["Year"]==2013]
arr = arr["JobTitle"].value_counts()
k = arr[arr ==1]
print(k.count())

202

C:\Users\prash\AppData\Local\Temp\ipykernel_14304\2808510939.py:4: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv("Salaries.csv")